TestDataFolder/TestDataFolder/NVCRMCreateUser.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsdl="http://tews6/wsdl">
  
   <soapenv:Body>
      <wsdl:NVCRMCreateUser>
         
         <wsdl:NVCRMCreateUserObjectProfileTab>
           
            <wsdl:_BAR_eMailAddress_BAR_>rjally@innominds.com</wsdl:_BAR_eMailAddress_BAR_>
            <wsdl:_BAR_firstName_BAR_>rajitha</wsdl:_BAR_firstName_BAR_>
            <wsdl:_BAR_lastName_BAR_>Jally</wsdl:_BAR_lastName_BAR_>
            <wsdl:_BAR_company_BAR_>innominds</wsdl:_BAR_company_BAR_>
            <wsdl:_BAR_industry_BAR_>Other</wsdl:_BAR_industry_BAR_>
            <wsdl:_BAR_jobRole_BAR_>Other</wsdl:_BAR_jobRole_BAR_>
            <wsdl:_BAR_street1_BAR_>123avenue</wsdl:_BAR_street1_BAR_>
            
            <wsdl:_BAR_street2_BAR_>456Avenue</wsdl:_BAR_street2_BAR_>
            <wsdl:_BAR_state_BAR_>AL</wsdl:_BAR_state_BAR_>
            <wsdl:_BAR_postalCode_BAR_>?</wsdl:_BAR_postalCode_BAR_>
            <wsdl:_BAR_country_BAR_>US</wsdl:_BAR_country_BAR_>
            <wsdl:_BAR_sfdcRole_BAR_>NVCRMAccessRole</wsdl:_BAR_sfdcRole_BAR_>
            
            <wsdl:_BAR_gridEval_BAR_></wsdl:_BAR_gridEval_BAR_>
            <wsdl:_BAR_language_BAR_>en</wsdl:_BAR_language_BAR_>
            <wsdl:_BAR_sfdcMailTemplate_BAR_>mail</wsdl:_BAR_sfdcMailTemplate_BAR_>
            <wsdl:_BAR_phone_BAR_>1234567890</wsdl:_BAR_phone_BAR_>
            <wsdl:_BAR_sfdcUserID_BAR_>rjally@innominds.com</wsdl:_BAR_sfdcUserID_BAR_>
            <wsdl:_BAR_city_BAR_>sfo</wsdl:_BAR_city_BAR_>
			<wsdl:_BAR_isActive_BAR_>1</wsdl:_BAR_isActive_BAR_>

         </wsdl:NVCRMCreateUserObjectProfileTab>
      </wsdl:NVCRMCreateUser>
   </soapenv:Body>
</soapenv:Envelope>